<root><EntiteDuMondeDeLaFormation/><EntiteDuMondeDeLaFormation><Identifiant>ISO-IEC22602:RC0007</Identifiant><Nom>Institution</Nom><Definition>un &#233;l&#233;ment de cette classe est  une entit&#233; compos&#233;e d'&#234;tres humains, organis&#233;e dans la dur&#233;e,en vue d'une finalit&#233; et dot&#233;e d'une personalit&#233; juridique</Definition><Sousclassede>RC0700</Sousclassede><Note>Exemple : Le lyc&#233;e Flaubert de Rouen</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0000</Identifiant><Nom>Entit&#233; du monde de la formation</Nom><Definition>classe abstraite qui regroupe les propri&#233;t&#233;s communes &#224; toutes les situations ou &#224; l'ensemble de situations visant un ou plusieurs objectifs de d&#233;veloppement personnel ou professionnel</Definition><Sousclassede/><Note>Super classe de toutes les classes. Elle regroupe toutes les propri&#233;t&#233;s des classes pr&#233;sentes dans ce mod&#232;le

</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0015</Identifiant><Nom>Certificat, badge, diplome</Nom><Definition>un &#233;l&#233;ment de cette classe est la reconnaissance des comp&#233;tences, des connaissances, des savoir-faire d'une personne</Definition><Sousclassede>RC0000</Sousclassede><Note>Exemple : reconnaissance des comp&#233;tences, des connaissances, des savoir-faire d'une personne</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0016</Identifiant><Nom>Certification</Nom><Definition>un &#233;l&#233;ment de cette classe est la reconnaissance de la qualit&#233; de l'offre d'un organisme donn&#233; selon un r&#233;f&#233;rentiel sp&#233;cifi&#233;</Definition><Sousclassede>RC0000</Sousclassede><Note>Exemple : Certification ISO 9001, QUALIOPI</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0017</Identifiant><Nom>Niveau de certification</Nom><Definition>un &#233;l&#233;ment de cette classe repr&#233;sente un niveau de certification dans un syst&#232;me de codification</Definition><Sousclassede>RC0000</Sousclassede><Note>Exemple : Niveau 5 du CEC</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0020</Identifiant><Nom>Offre de formation</Nom><Definition>un &#233;l&#233;ment de cette classe est une formation d&#233;crite au niveau national, cette formation pouvant donner lieu &#224; une attestation ou &#224; pr&#233;parer &#224; un dipl&#244;me, une qualification, un certificat</Definition><Sousclassede>RC0050, RC0030</Sousclassede><Note>Exemple : description d'un BTS services informatiques aux organisations (BTS SIO) au niveau national</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0030</Identifiant><Nom>Condition d'acc&#232;s</Nom><Definition>un &#233;l&#233;ment de cette classe indique les conditions d'admission pour pouvoir postuler &#224; une offre de formation</Definition><Sousclassede>RC0000</Sousclassede><Note>Ces conditions peuvent &#234;tre exprim&#233;es de fa&#231;on formelle ou informelle. Il peut y avoir plusieurs instances des modalit&#233;s de s&#233;lection</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0031</Identifiant><Nom>Pr&#233;requis</Nom><Definition>un &#233;l&#233;ment de cette classe indique un ou plusieurs pr&#233;requis pour pouvoir postuler &#224; une offre de formation</Definition><Sousclassede>RC0000</Sousclassede><Note>Ces pr&#233;requis sont exprim&#233;s de mani&#232;re informelle</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0032</Identifiant><Nom>Modalit&#233; de s&#233;lection</Nom><Definition>un &#233;l&#233;ment de cette classe indique une ou plusieurs modalit&#233;s de s&#233;lection pour pouvoir &#234;tre admis &#224; une offre de formation</Definition><Sousclassede>RC0000</Sousclassede><Note>Ces modalit&#233;s de s&#233;lection sont d&#233;crites de mani&#232;re informelle</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0040</Identifiant><Nom>Frais de formation</Nom><Definition>un &#233;l&#233;ment de cette classe est une d&#233;pense pour l'apprenant li&#233;e &#224; la participation &#224; la formation</Definition><Sousclassede/><Note>Exemple : Les frais d'inscription au BTS SIO ou les frais p&#233;dagogiques du m&#234;me BTS en formation continue</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0050</Identifiant><Nom>Caract&#233;ristiques de la formation</Nom><Definition>classe abstraite qui regroupe les propri&#233;t&#233; communes aux offres de formation et aux cas d&#233;crivant l'organisation p&#233;dagoqique d'une formation</Definition><Sousclassede>RC0000</Sousclassede><Note>Super classe des classes offre de formation et formation</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0060</Identifiant><Nom>Composition</Nom><Definition>classe abstraite qui d&#233;finit la composition d'une action de formation, d'un parcours ou d'un module en termes d'&#233;l&#233;ment de formation</Definition><Sousclassede/><Note>Super classe des classes "composition" obligatoire, optionnelle et &#224; choix</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0061</Identifiant><Nom>Compositon obligatoire</Nom><Definition>classe qui d&#233;finit le caract&#232;re obligatoire de la composition d'une action de formation, d'un parcours ou d'un module en termes d'&#233;l&#233;ments de formation</Definition><Sousclassede>RC0060</Sousclassede><Note>Exemple : dans le BTS SIO pour le module "bloc 2" du parcours "SLAM", l'&#233;l&#233;ment de formation "Conception et d&#233;veloppement d'applications est obligatoire</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0062</Identifiant><Nom>Composition optionnelle</Nom><Definition>classe qui d&#233;finit le caract&#232;re optionnel de la composition d'une action de formation, d'un parcours ou d'un module en termes d'&#233;l&#233;ments de formation</Definition><Sousclassede>RC0060</Sousclassede><Note>Exemple : dans le BTS SIO pour le parcours "SLAM", l'&#233;l&#233;ment de formation "Math&#233;matiques approfondies" est optionnel</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0063</Identifiant><Nom>Composition &#224; choix</Nom><Definition>classe qui d&#233;finit le caract&#232;re "&#224; choix" de la composition d'une action de formation, d'un parcours ou d'un module en termes d'&#233;l&#233;ments de formation</Definition><Sousclassede>RC0060</Sousclassede><Note>Exemple : dans le module M d'un parcours P, un &#233;tudiant peut choisir entre 2 et 3 &#233;l&#233;ments de formation parmi 5</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0070</Identifiant><Nom>Cr&#233;dits ECTS</Nom><Definition>classe qui d&#233;finit le nombre de cr&#233;dits ECTS qui peuvent &#234;tre contextuels &#224; une offre de formation</Definition><Sousclassede>RC0000</Sousclassede><Note/></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0080</Identifiant><Nom>Session d'information</Nom><Definition>classe qui pr&#233;sente une r&#233;alisation lors d'une session d'information</Definition><Sousclassede>RC0000</Sousclassede><Note>Exemple : le BTS SIO option SLAM pour l'ann&#233;e 2020-2021 sera pr&#233;sent&#233; aux &#233;tudiants le 4 avril 2020 &#224; 14h</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0090</Identifiant><Nom>P&#233;riode d'interruption</Nom><Definition>classe qui d&#233;finit toute p&#233;riode d'interruption (vacances, fermeture administrative, etc.) pour une r&#233;alisation</Definition><Sousclassede>RC0000</Sousclassede><Note>Exemple :  pour l'ann&#233;e 2020-2021 les &#233;tudiants BTS SIO n'ont pas cours du 19 d&#233;cembre 2020 au 3 janvier 2021</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0100</Identifiant><Nom>Formation</Nom><Definition>classe abstraite qui regroupe les propri&#233;t&#233;s communes decrivant l'organisation p&#233;dagogique de la formation dans une institution</Definition><Sousclassede>RC0050, RC0030</Sousclassede><Note>Super classe des classes action de formation, parcours, module, &#233;l&#233;ment de formation et activit&#233; p&#233;dagogique</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0101</Identifiant><Nom>Action de formation</Nom><Definition>un &#233;l&#233;ment de cette classe est la r&#233;alisation concr&#232;te de la formation (sens catalogue). Il d&#233;crit un itin&#233;raire compos&#233; de situations de formation permettant d'atteindre un objectif de d&#233;veloppement personnel ou professionnel sp&#233;cifi&#233;</Definition><Sousclassede>RC0100, RC0030</Sousclassede><Note>Cette classe se concr&#233;tise dans un catalogue. Elle se d&#233;cline en un ou plusieurs parcours. Exemple : description g&#233;n&#233;rale du BTS services informatiques aux organisations (BTS SIO) dans le lyc&#233;e Flaubert de Rouen</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0102</Identifiant><Nom>Parcours</Nom><Definition>un &#233;l&#233;ment de cette classe est un itin&#233;raire p&#233;dagogique comportant un ou plusieurs &#233;l&#233;ments de formation sp&#233;cifi&#233;s et ordonn&#233;s, organis&#233; selon une ou plusieurs modalit&#233;s sp&#233;cifi&#233;es, en vue d'atteindre un objectif de d&#233;veloppement personnel ou professionnel</Definition><Sousclassede>RC0100</Sousclassede><Note>Cette classe se compose d'un ou plusieurs modules. Exemple : Itin&#233;raire p&#233;dagogique en deux ans, en formation initiale, permettant d'acqu&#233;rir un BTS services informatiques aux organisations (BTS SIO), option 1 SLAM solutions logicielles et applications m&#233;tier propos&#233; par le lyc&#233;e Flaubert de Rouen</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0103</Identifiant><Nom>Module</Nom><Definition>un &#233;l&#233;ment de cette classe est un regroupement temporel, th&#233;matique ou p&#233;dagogique d'&#233;l&#233;ments de formation. </Definition><Sousclassede>RC0100</Sousclassede><Note>Un module est l'organisation temporelle, th&#233;matique ou p&#233;dagogique d'une partie de la formation. Exemple : AU lyc&#233;e Flaubert de Rouen, l'option 1 SLAM solutions logicielles et applications m&#233;tier du BTS SIO est compos&#233;e de 2 modules 1&#232;re ann&#233;e et 2&#232;me ann&#233;e, ce deuxi&#232;me succ&#233;dant au premier. Chaque ann&#233;e &#233;tant compos&#233;e de 2 modules 1er semestre et 2eme semestre, le 2&#232;me succ&#233;dant au 1er</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0104</Identifiant><Nom>&#201;l&#233;ment de formation</Nom><Definition>un &#233;l&#233;ment de cette classe permet de d&#233;composer les modules en unit&#233;s p&#233;dagogiques</Definition><Sousclassede>RC0100</Sousclassede><Note>Un &#233;l&#233;ment de formation peut &#234;tre compos&#233; d'activit&#233;s p&#233;dagogiques. Il peut correspondre &#224; un "cours" ou un ensemble de cours p&#233;dagogiquement coh&#233;rents. Pour l'enseignement sup&#233;rieur le trait&#233; de Bologne appelle cette notion unit&#233; d'enseignement. Exemple : Au sein du BTS services informatiques aux organisations (BTS SIO), option 1 SLAM solutions logicielles et applications m&#233;tier propos&#233; par le lyc&#233;e Flaubert de Rouen, il y a un &#233;l&#233;ment de formation "Math&#233;matiques pour l'informatique" compos&#233; des &#233;l&#233;ments de formations  "math&#233;matiques" et "algorithmique avanc&#233;e"</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0105</Identifiant><Nom>Activit&#233; p&#233;dagogique</Nom><Definition>un &#233;l&#233;ment de cette classe est une forme sp&#233;cifique d'une situation con&#231;ue pour apprendre</Definition><Sousclassede>RC0100</Sousclassede><Note>Une activit&#233; p&#233;dagogique peut &#234;tre d&#233;crite en sp&#233;cifiant son type, sa modalit&#233; de mise en oeuvre et le mat&#233;riel n&#233;cessaire &#224; sa r&#233;alisation. Exemple : travaux pratiques en  r&#233;seau informatique n&#233;cessitant un routeur internet.</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0200</Identifiant><Nom>R&#233;alisation</Nom><Definition>classe abstraite  qui regroupe les propri&#233;t&#233;s communes d&#233;crivant les r&#233;alisations programm&#233;es d'une offre de formation</Definition><Sousclassede>RC0000</Sousclassede><Note>Superclasse des classes R&#233;alisation de parcours, R&#233;alisation de module, R&#233;alisation de la session de formation et R&#233;alisation de l'activit&#233; p&#233;dagogique</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0201</Identifiant><Nom>R&#233;alisation de parcours</Nom><Definition>un &#233;l&#233;ment de cette classe est la r&#233;alisation d'un parcours de formation programm&#233;</Definition><Sousclassede>RC0200</Sousclassede><Note>Une r&#233;alisation de parcours est la programmation pendant une p&#233;riode donn&#233;e, &#224; un endroit donn&#233;. Exemple : Programmation de l'option 1 SLAM solutions logicielles et applications m&#233;tier du BTS SIO sur la p&#233;riode 2020-2022 au lyc&#233;e Flaubert de Rouen</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0202</Identifiant><Nom>R&#233;alisation de module</Nom><Definition>un &#233;l&#233;ment de cette classe est la r&#233;alisation d'un module programm&#233;</Definition><Sousclassede>RC0200</Sousclassede><Note>Une r&#233;alisation de module est la programmation pendant une p&#233;riode donn&#233;e &#224; un endroit donn&#233; d'un module de formation. Exemple : Le module du 1er semestre de la 1&#232;re ann&#233;e du BTS SIO option 1 SLAM solutions logicielles et applications m&#233;tier commence en septembre 2020 et finit en janvier 2021 au Lyc&#233;e Flaubert de Rouen</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0203</Identifiant><Nom>Session de formation</Nom><Definition>un &#233;l&#233;ment de cette classe est la r&#233;alisation d'une session de formation programm&#233;e</Definition><Sousclassede>RC0200</Sousclassede><Note>Une session de formation est la programmation pendant une p&#233;riode donn&#233;e &#224; un endroit donn&#233; d'un &#233;l&#233;ment de formation. Exemple : Programmation de l'&#233;l&#233;ment de formation "Algorithmique appliqu&#233;e" de l'option 1 SLAM solutions logicielles et applications m&#233;tier du BTS SIO de septembre 2020 &#224; janvier 2021 au lyc&#233;e Flaubert de Rouen.</Note></EntiteDuMondeDeLaFormation><EntiteDuMondeDeLaFormation><Identifiant>RC0204</Identifiant><Nom>R&#233;alisation d'activit&#233; p&#233;dagogique</Nom><Definition>un &#233;l&#233;ment de cette classe est la r&#233;alisation d'une activit&#233; p&#233;dagogique programm&#233;e</Definition><Sousclassede>RC0200</Sousclassede><Note>Une r&#233;alisation d'une activit&#233; p&#233;dagogique est la programmation pendant une p&#233;riode donn&#233;e &#224; un endroit donn&#233; d'une activit&#233; de p&#233;dagogique. Exemple : Programmation du premier cours magistral de l'activit&#233; p&#233;dagogique "Algotihmique appliqu&#233;e" de l'option 1 SLAM solutions logicielles et applications m&#233;tier du BTS SIO le mardi 8 septembre 2020 de 8h &#224; 9h30 en salle 505 du lyc&#233;e Flaubert de Rouen</Note></EntiteDuMondeDeLaFormation></root>